Ran Plan for 2 projects:

1. project: `project-demo` dir: `Terraform/quick_demo` workspace: `default`
1. project: `project-module-demo` dir: `Terraform/module_demo/project_1` workspace: `default`

### 1. project: `project-demo` dir: `Terraform/quick_demo` workspace: `default`
<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_network.default will be created
+ resource "google_compute_network" "default" {
+       auto_create_subnetworks         = false
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       internal_ipv6_range             = (known after apply)
+       mtu                             = (known after apply)
+       name                            = "wade-test-network"
+       project                         = "global-sre-dev"
+       routing_mode                    = "GLOBAL"
+       self_link                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p project-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-demo.wadexu.cloud/lock?id=wadexu007%252Flearning_by_doing%252FTerraform%252Fquick_demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p project-demo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `project-module-demo` dir: `Terraform/module_demo/project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
module.firewall_okta.data.http.okta_cloud_ip_ranges: Reading...
module.firewall_okta.data.http.okta_cloud_ip_ranges: Read complete after 0s [id=https://s3.amazonaws.com/okta-ip-ranges/ip_ranges.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.firewall_okta.google_compute_firewall.allow-cluster-okta will be created
+ resource "google_compute_firewall" "allow-cluster-okta" {
+       creation_timestamp = (known after apply)
+       destination_ranges = [
+           "100.26.39.159/32",
+           "107.20.244.149/32",
+           "107.20.82.76/32",
+           "107.21.220.50/32",
+           "107.22.173.115/32",
+           "107.22.174.147/32",
+           "107.22.176.74/32",
+           "107.22.222.34/32",
+           "13.248.130.81/32",
+           "13.248.134.123/32",
+           "13.248.165.67/32",
+           "13.248.168.94/32",
+           "13.248.176.111/32",
+           "13.248.194.80/32",
+           "13.248.195.81/32",
+           "13.248.198.65/32",
+           "13.248.209.106/32",
+           "13.248.222.83/32",
+           "13.248.240.102/32",
+           "13.248.241.107/32",
+           "13.248.243.103/32",
+           "15.197.134.95/32",
+           "15.197.139.67/32",
+           "15.197.143.65/32",
+           "15.197.146.112/32",
+           "15.197.151.86/32",
+           "15.197.171.110/32",
+           "15.197.171.98/32",
+           "15.197.176.120/32",
+           "15.197.177.64/32",
+           "15.197.185.83/32",
+           "15.197.186.118/32",
+           "15.197.201.95/32",
+           "15.197.205.100/32",
+           "15.197.208.115/32",
+           "15.197.208.92/32",
+           "15.197.211.77/32",
+           "15.197.214.115/32",
+           "15.197.216.73/32",
+           "15.197.217.104/32",
+           "15.197.217.66/32",
+           "15.197.224.92/32",
+           "15.197.229.123/32",
+           "15.197.233.105/32",
+           "15.197.238.110/32",
+           "15.197.238.86/32",
+           "15.197.242.105/32",
+           "15.197.243.65/32",
+           "15.197.244.112/32",
+           "15.197.248.88/32",
+           "15.197.252.76/32",
+           "15.197.253.65/32",
+           "18.204.109.174/32",
+           "18.204.121.42/32",
+           "18.205.120.122/32",
+           "18.205.121.184/32",
+           "18.206.1.0/32",
+           "18.206.105.228/32",
+           "18.206.6.207/32",
+           "18.207.62.254/32",
+           "18.208.93.55/32",
+           "18.208.97.91/32",
+           "18.209.113.128/26",
+           "18.209.52.228/32",
+           "18.209.75.116/32",
+           "18.210.185.123/32",
+           "18.210.202.65/32",
+           "18.210.226.134/32",
+           "18.210.226.249/32",
+           "18.210.249.209/32",
+           "18.211.150.170/32",
+           "18.211.204.6/32",
+           "18.211.217.115/32",
+           "18.212.0.168/32",
+           "18.212.43.70/32",
+           "18.213.152.156/32",
+           "18.213.162.39/32",
+           "18.213.173.112/32",
+           "18.213.221.208/32",
+           "18.213.244.31/32",
+           "18.213.255.14/32",
+           "18.213.72.172/32",
+           "18.214.105.0/32",
+           "18.214.106.230/32",
+           "18.214.118.120/32",
+           "18.214.129.49/32",
+           "18.214.13.226/32",
+           "18.214.138.155/32",
+           "18.214.141.37/32",
+           "18.214.199.63/32",
+           "18.214.207.134/32",
+           "18.214.216.102/32",
+           "18.214.233.127/32",
+           "18.214.237.3/32",
+           "18.214.247.61/32",
+           "18.214.29.252/32",
+           "18.214.43.227/32",
+           "18.214.61.20/32",
+           "18.214.70.68/32",
+           "18.214.80.21/32",
+           "18.214.91.146/32",
+           "18.215.105.244/32",
+           "18.215.110.184/32",
+           "18.215.139.221/32",
+           "18.215.139.251/32",
+           "18.215.139.76/32",
+           "18.215.24.11/32",
+           "18.215.25.6/32",
+           "18.215.26.4/32",
+           "18.215.46.180/32",
+           "18.215.65.99/32",
+           "18.215.67.36/32",
+           "18.215.69.215/32",
+           "18.232.196.203/32",
+           "18.232.217.162/32",
+           "18.232.226.254/32",
+           "18.232.27.190/32",
+           "18.232.39.36/32",
+           "18.233.145.54/32",
+           "18.236.11.229/32",
+           "18.236.59.136/32",
+           "184.72.166.120/32",
+           "184.72.239.181/32",
+           "184.72.239.183/32",
+           "184.73.186.14/32",
+           "184.73.186.54/32",
+           "184.73.186.59/32",
+           "184.73.186.64/32",
+           "204.236.220.124/32",
+           "23.21.111.242/32",
+           "23.21.113.84/32",
+           "23.21.120.216/32",
+           "23.21.188.136/32",
+           "23.21.202.177/32",
+           "23.21.203.151/32",
+           "23.21.220.245/32",
+           "23.21.230.22/32",
+           "23.21.231.189/32",
+           "23.21.56.100/32",
+           "23.22.192.73/32",
+           "23.22.252.160/32",
+           "23.23.124.137/32",
+           "23.23.234.166/32",
+           "3.209.155.17/32",
+           "3.209.190.45/32",
+           "3.211.11.39/32",
+           "3.211.36.37/32",
+           "3.213.199.23/32",
+           "3.214.65.180/32",
+           "3.215.62.127/32",
+           "3.219.96.46/32",
+           "3.223.66.238/32",
+           "3.224.216.125/32",
+           "3.226.27.146/32",
+           "3.228.125.233/32",
+           "3.228.137.207/32",
+           "3.230.200.115/32",
+           "3.232.206.170/32",
+           "3.234.176.133/32",
+           "3.33.136.245/32",
+           "3.33.145.223/32",
+           "3.33.145.233/32",
+           "3.33.150.225/32",
+           "3.33.152.248/32",
+           "3.33.173.250/32",
+           "3.33.176.199/32",
+           "3.33.182.230/32",
+           "3.33.185.234/32",
+           "3.33.190.194/32",
+           "3.33.190.255/32",
+           "3.33.194.197/32",
+           "3.33.194.234/32",
+           "3.33.195.254/32",
+           "3.33.199.193/32",
+           "3.33.201.229/32",
+           "3.33.206.212/32",
+           "3.33.207.203/32",
+           "3.33.207.222/32",
+           "3.33.211.211/32",
+           "3.33.215.209/32",
+           "3.33.224.198/32",
+           "3.33.224.229/32",
+           "3.33.226.239/32",
+           "3.33.226.241/32",
+           "3.33.234.235/32",
+           "3.33.235.225/32",
+           "3.33.237.204/32",
+           "3.33.238.255/32",
+           "3.33.242.249/32",
+           "3.33.248.222/32",
+           "3.33.253.249/32",
+           "3.82.0.92/32",
+           "3.89.235.71/32",
+           "3.93.155.251/32",
+           "34.192.82.184/32",
+           "34.193.146.128/32",
+           "34.193.149.9/32",
+           "34.196.126.232/32",
+           "34.196.16.97/32",
+           "34.197.132.26/32",
+           "34.198.207.37/32",
+           "34.198.71.253/32",
+           "34.201.226.82/32",
+           "34.202.114.70/32",
+           "34.202.149.224/32",
+           "34.202.222.15/32",
+           "34.202.89.251/32",
+           "34.203.255.192/26",
+           "34.206.249.118/32",
+           "34.207.51.94/32",
+           "34.209.107.230/32",
+           "34.217.170.83/32",
+           "34.218.156.127/32",
+           "34.223.95.128/27",
+           "34.224.190.91/32",
+           "34.225.170.33/32",
+           "34.226.25.226/32",
+           "34.230.237.20/32",
+           "34.231.149.193/32",
+           "34.232.145.255/32",
+           "34.232.43.168/32",
+           "34.232.82.186/32",
+           "34.232.9.172/32",
+           "34.233.180.48/32",
+           "34.233.96.147/32",
+           "34.234.133.222/32",
+           "34.234.37.64/32",
+           "34.235.212.255/32",
+           "34.236.97.182/32",
+           "34.237.50.173/32",
+           "34.238.196.244/32",
+           "34.238.6.63/32",
+           "34.239.14.207/32",
+           "34.239.36.97/32",
+           "34.239.60.253/32",
+           "34.239.73.6/32",
+           "35.153.214.153/32",
+           "35.155.128.3/32",
+           "35.155.83.50/32",
+           "35.160.153.62/32",
+           "35.160.174.115/32",
+           "35.163.186.214/32",
+           "35.164.78.160/32",
+           "35.165.238.96/32",
+           "35.165.94.114/32",
+           "35.166.101.225/32",
+           "35.166.141.128/32",
+           "35.166.214.252/32",
+           "35.167.147.26/32",
+           "35.167.177.126/32",
+           "35.167.185.142/32",
+           "35.168.104.66/32",
+           "35.168.141.22/32",
+           "35.168.177.210/32",
+           "35.168.197.35/32",
+           "35.168.202.253/32",
+           "35.168.242.145/32",
+           "35.169.12.81/32",
+           "35.170.4.157/32",
+           "35.171.141.170/32",
+           "35.171.210.106/32",
+           "35.171.242.74/32",
+           "35.171.97.176/32",
+           "35.172.126.60/32",
+           "35.172.152.16/32",
+           "35.174.103.86/32",
+           "35.174.121.25/32",
+           "35.174.169.125/32",
+           "35.174.20.41/32",
+           "35.174.48.156/32",
+           "35.71.128.194/32",
+           "35.71.133.245/32",
+           "35.71.136.234/32",
+           "35.71.140.215/32",
+           "35.71.140.216/32",
+           "35.71.144.196/32",
+           "35.71.153.225/32",
+           "35.71.156.238/32",
+           "35.71.157.229/32",
+           "35.71.158.223/32",
+           "35.71.158.239/32",
+           "35.71.159.217/32",
+           "35.71.164.254/32",
+           "35.71.166.211/32",
+           "35.71.168.214/32",
+           "35.71.178.224/32",
+           "35.71.187.236/32",
+           "35.71.190.245/32",
+           "35.81.174.165/32",
+           "35.82.213.112/32",
+           "35.83.59.190/32",
+           "35.85.225.0/27",
+           "44.194.111.64/27",
+           "44.195.203.192/27",
+           "44.227.233.166/32",
+           "44.229.222.178/32",
+           "44.232.71.176/32",
+           "44.235.240.204/32",
+           "44.236.57.165/32",
+           "44.236.81.92/32",
+           "44.237.114.154/32",
+           "44.237.123.56/32",
+           "44.237.181.25/32",
+           "44.237.73.115/32",
+           "44.240.106.180/32",
+           "44.240.156.104/32",
+           "44.240.62.136/32",
+           "44.240.7.25/32",
+           "44.242.133.164/32",
+           "50.112.110.29/32",
+           "50.112.120.112/32",
+           "50.112.120.122/32",
+           "50.112.120.162/32",
+           "50.112.120.189/32",
+           "50.112.120.226/32",
+           "50.112.121.165/32",
+           "50.112.121.193/32",
+           "50.112.124.45/32",
+           "50.112.124.47/32",
+           "50.16.242.108/32",
+           "50.16.242.193/32",
+           "50.17.176.180/32",
+           "50.17.248.46/32",
+           "50.17.60.249/32",
+           "50.19.107.116/32",
+           "50.19.107.162/32",
+           "50.19.107.226/32",
+           "50.19.107.73/32",
+           "50.19.225.214/32",
+           "50.19.250.62/32",
+           "52.0.61.215/32",
+           "52.1.145.184/32",
+           "52.1.235.71/32",
+           "52.1.31.19/32",
+           "52.1.56.75/32",
+           "52.1.65.161/32",
+           "52.11.208.2/32",
+           "52.11.249.255/32",
+           "52.13.138.51/32",
+           "52.13.177.77/32",
+           "52.13.233.100/32",
+           "52.200.115.227/32",
+           "52.200.197.156/32",
+           "52.202.44.14/32",
+           "52.204.217.72/32",
+           "52.206.198.212/32",
+           "52.207.21.207/32",
+           "52.207.88.176/32",
+           "52.21.118.50/32",
+           "52.21.12.93/32",
+           "52.22.21.123/32",
+           "52.223.0.68/32",
+           "52.223.12.112/32",
+           "52.223.2.120/32",
+           "52.223.20.101/32",
+           "52.223.21.89/32",
+           "52.223.24.125/32",
+           "52.223.30.84/32",
+           "52.223.37.120/32",
+           "52.223.38.87/32",
+           "52.223.38.91/32",
+           "52.223.40.102/32",
+           "52.223.45.111/32",
+           "52.223.48.118/32",
+           "52.223.49.115/32",
+           "52.223.50.94/32",
+           "52.223.50.96/32",
+           "52.223.52.90/32",
+           "52.223.7.101/32",
+           "52.223.7.86/32",
+           "52.24.130.170/32",
+           "52.24.159.51/32",
+           "52.24.65.21/32",
+           "52.25.138.88/32",
+           "52.25.36.15/32",
+           "52.26.184.33/32",
+           "52.27.149.252/32",
+           "52.3.238.237/32",
+           "52.35.147.181/32",
+           "52.35.50.192/32",
+           "52.35.51.135/32",
+           "52.36.207.230/32",
+           "52.38.32.46/32",
+           "52.40.7.213/32",
+           "52.41.113.175/32",
+           "52.42.29.218/32",
+           "52.43.110.95/32",
+           "52.44.155.8/32",
+           "52.5.78.161/32",
+           "52.7.101.96/32",
+           "52.7.28.177/32",
+           "52.70.98.56/32",
+           "52.71.112.101/32",
+           "52.71.67.120/32",
+           "52.71.70.64/32",
+           "52.71.74.113/32",
+           "52.72.34.134/32",
+           "52.73.143.191/32",
+           "52.86.16.174/32",
+           "52.87.4.159/32",
+           "52.88.245.156/32",
+           "52.88.30.84/32",
+           "54.145.255.140/32",
+           "54.147.140.211/32",
+           "54.148.92.73/32",
+           "54.156.5.212/32",
+           "54.158.173.127/32",
+           "54.161.96.70/32",
+           "54.162.72.87/32",
+           "54.163.224.96/32",
+           "54.163.240.100/32",
+           "54.163.247.137/32",
+           "54.163.250.175/32",
+           "54.163.250.93/32",
+           "54.163.255.229/32",
+           "54.165.163.230/32",
+           "54.165.170.15/32",
+           "54.166.200.68/32",
+           "54.172.51.31/32",
+           "54.174.84.81/32",
+           "54.186.145.246/32",
+           "54.189.238.173/32",
+           "54.189.255.224/27",
+           "54.190.90.9/32",
+           "54.197.107.46/32",
+           "54.197.192.160/27",
+           "54.197.88.168/32",
+           "54.200.53.172/32",
+           "54.201.170.125/32",
+           "54.201.225.95/32",
+           "54.203.145.181/32",
+           "54.203.188.154/32",
+           "54.203.248.112/32",
+           "54.203.252.78/32",
+           "54.208.240.221/32",
+           "54.208.253.212/32",
+           "54.210.77.10/32",
+           "54.211.44.254/32",
+           "54.213.254.193/32",
+           "54.214.191.114/32",
+           "54.214.251.247/32",
+           "54.214.252.78/32",
+           "54.214.253.241/32",
+           "54.214.254.193/32",
+           "54.218.192.52/32",
+           "54.218.219.9/32",
+           "54.218.245.98/32",
+           "54.221.216.145/32",
+           "54.221.217.68/32",
+           "54.221.217.72/32",
+           "54.221.222.17/32",
+           "54.224.122.158/32",
+           "54.227.135.148/32",
+           "54.235.107.71/32",
+           "54.235.118.189/32",
+           "54.235.244.173/32",
+           "54.235.64.100/32",
+           "54.235.64.102/32",
+           "54.235.64.85/32",
+           "54.235.64.95/32",
+           "54.235.64.96/32",
+           "54.235.68.72/31",
+           "54.235.68.74/32",
+           "54.235.68.76/32",
+           "54.235.68.78/32",
+           "54.235.89.255/32",
+           "54.237.172.125/32",
+           "54.243.198.44/32",
+           "54.243.207.71/32",
+           "54.243.212.161/32",
+           "54.243.212.165/32",
+           "54.243.50.205/32",
+           "54.243.51.23/32",
+           "54.244.115.143/32",
+           "54.244.90.165/32",
+           "54.244.92.253/32",
+           "54.244.92.254/32",
+           "54.244.93.0/32",
+           "54.245.102.6/32",
+           "54.245.109.251/32",
+           "54.245.77.225/32",
+           "54.245.89.24/32",
+           "54.245.89.26/32",
+           "54.245.89.3/32",
+           "54.245.89.35/32",
+           "54.245.89.46/32",
+           "54.245.93.35/32",
+           "54.68.221.171/32",
+           "54.69.197.96/32",
+           "54.71.107.12/32",
+           "54.81.1.92/32",
+           "54.82.186.104/32",
+           "54.82.97.76/32",
+           "54.83.39.70/32",
+           "54.83.39.79/32",
+           "54.83.45.80/32",
+           "54.86.175.97/32",
+           "54.86.204.118/32",
+           "54.89.52.11/32",
+           "75.101.132.60/32",
+           "75.2.106.85/32",
+           "75.2.114.79/32",
+           "75.2.16.120/32",
+           "75.2.41.113/32",
+           "75.2.44.79/32",
+           "75.2.44.90/32",
+           "75.2.50.116/32",
+           "75.2.56.69/32",
+           "75.2.63.115/32",
+           "75.2.66.109/32",
+           "75.2.69.100/32",
+           "75.2.8.118/32",
+           "75.2.87.65/32",
+           "76.223.1.216/32",
+           "76.223.111.216/32",
+           "76.223.114.238/32",
+           "76.223.115.216/32",
+           "76.223.2.241/32",
+           "76.223.42.213/32",
+           "76.223.53.194/32",
+           "76.223.59.226/32",
+           "76.223.70.214/32",
+           "76.223.71.210/32",
+           "76.223.78.225/32",
+           "76.223.79.249/32",
+           "76.223.94.197/32",
+           "99.83.144.240/32",
+           "99.83.148.234/32",
+           "99.83.160.202/32",
+           "99.83.180.198/32",
+           "99.83.186.246/32",
+           "99.83.192.225/32",
+           "99.83.213.230/32",
+           "99.83.218.249/32",
+           "99.83.226.210/32",
+           "99.83.239.245/32",
+           "99.83.239.254/32",
+           "99.83.241.219/32",
+           "99.83.247.192/32",
        ]
+       direction          = "EGRESS"
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "fw-allow-egress-cluster-to-okta"
+       network            = "wade-test-network"
+       priority           = 1000
+       project            = "global-sre-dev"
+       self_link          = (known after apply)

+       allow {
+           ports    = [
+               "443",
            ]
+           protocol = "tcp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p project-module-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-demo.wadexu.cloud/lock?id=wadexu007%252Flearning_by_doing%252FTerraform%252Fmodule_demo%252Fproject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p project-module-demo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
